Documents/ВСД2_КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_КорректировкаРеализации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВСДКАннулированию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВСДКГашению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОформленныеКорректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВСД2_КорректировкаРеализации/Ext/ObjectModule.bsl
// GRACE:MODULE_START name="КорректировкаРеализации"
// @grace-module: КорректировкаРеализации
// @grace-purpose: Объектный модуль документа ВСД2_КорректировкаРеализации — заполнение из документа-основания и установка признака обработанности перед записью
// @grace-depends: КорректировкаРеализации, ЯдроВСД
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="КорректировкаРеализации"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"

// LLM_NOTE: ПередЗаписью устанавливает реквизит Обработан на основе состояния строк ТЧ ВСДКАннулированию и ВСДКГашению.
// Это управляет доступностью формы (ТолькоПросмотр). НЕ изменять логику — она связана с UI формы.

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда

		ДокументОснование = ДанныеЗаполнения;
		Организация = ДокументОснование.Организация;

		Если ВетИС_УтилитыКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ДокументРеализации") Тогда
			ДокументРеализации = ДанныеЗаполнения.ДокументРеализации;
		ИначеЕсли ВетИС_УтилитыКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "ДокументОснование") Тогда
			ДокументРеализации = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// Проверяем, все ли строки в табличных частях обработаны
	ВсеСтрокиОбработаны = Истина;

	Для Каждого Стр Из ВСДКАннулированию Цикл
		Если Не Стр.Обработан Тогда
			ВсеСтрокиОбработаны = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ВсеСтрокиОбработаны Тогда
		Для Каждого Стр Из ВСДКГашению Цикл
			Если Не Стр.Обработан Тогда
				ВсеСтрокиОбработаны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//Если ВСДКАннулированию.Количество() И ВсеСтрокиОбработаны Тогда
	//	Для Каждого Стр Из ОформленныеКорректировки Цикл
	//		Если Не Стр.ВСД2_транзакция.СтатусВСД = Перечисления.кб99_СтатусВСД.CONFIRMED Тогда
	//			ВсеСтрокиОбработаны = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;

	// Устанавливаем признак в шапке
	Обработан = ВсеСтрокиОбработаны;

КонецПроцедуры
// GRACE:MODULE_END name="КорректировкаРеализации"
